subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_usblc__include
#define ti_devices_msp_peripherals_hw_usblc__include

/* Filename: hw_usblc.h */
/* Revised: 2025-05-20 01:38:34 */
/* Revision: 024fb13f0146b0eb8b43cb6270a7e6e1e9694d68 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* USBLC Registers
******************************************************************************/
#define USBLC_REGISTERS_OFS                      ((uint32_t)0x00002000U)
#define USBLC_CPU_INT_OFS                        ((uint32_t)0x00001020U)
#define USBLC_GPRCM_OFS                          ((uint32_t)0x00000800U)


/** @addtogroup USBLC_REGISTERS
  @{
*/

typedef struct {
  __IO uint8_t FADDR;                             /* !< (@ 0x00002000) USB Device Functional Address */
  __IO uint8_t POWER;                             /* !< (@ 0x00002001) USB Power Control */
  __I  uint8_t TXIS;                              /* !< (@ 0x00002002) USB TX Endpoint Interrupt Status */
       uint8_t  RESERVED0;
  __I  uint8_t RXIS;                              /* !< (@ 0x00002004) USB RX Endpoint Interrupt Status */
       uint8_t  RESERVED1;
  __IO uint8_t USBIS;                             /* !< (@ 0x00002006) USB General Interrupt Status */
  __IO uint8_t TXIE;                              /* !< (@ 0x00002007) USB IN Endpoint Interrupt Enable */
       uint8_t  RESERVED2;
  __IO uint8_t RXIE;                              /* !< (@ 0x00002009) USB Receive Interrupt Enable */
       uint8_t  RESERVED3;
  __IO uint8_t USBIE;                             /* !< (@ 0x0000200B) USB General Interrupt Enable */
  __IO uint8_t FRAMEL;                            /* !< (@ 0x0000200C) USB Last Received Frame Number (lower byte) */
  __IO uint8_t FRAMEH;                            /* !< (@ 0x0000200D) USB Last Received Frame Number (upper byte) */
  __IO uint8_t EPINDEX;                           /* !< (@ 0x0000200E) USB Endpoint Index */
       uint8_t  RESERVED4;
  __IO uint8_t IDXTXMAXP;                         /* !< (@ 0x00002010) USB Maximum Transmit Data Endpoint [n] */
  __IO uint8_t IDXTXCSRL;                         /* !< (@ 0x00002011) USB Transmit Control and Status Endpoint [n] Low */
  __IO uint8_t IDXTXCSRH;                         /* !< (@ 0x00002012) USB Transmit Control and Status Endpoint [n] High */
  __IO uint8_t IDXRXMAXP;                         /* !< (@ 0x00002013) USB Maximum Receive Data Endpoint [n] */
  __IO uint8_t IDXRXCSRL;                         /* !< (@ 0x00002014) USB Receive Control and Status Endpoint [n] Low */
  __IO uint8_t IDXRXCSRH;                         /* !< (@ 0x00002015) Indexed Receive Control and Status High */
  __IO uint8_t IDXRXCOUNTL;                       /* !< (@ 0x00002016) USB Receive Byte Count Endpoint [n] */
  __IO uint8_t IDXRXCOUNTH;                       /* !< (@ 0x00002017) USB Receive Byte Count Endpoint [n] */
       uint32_t RESERVED5[2];
  __IO uint8_t FIFO[16];                          /* !< (@ 0x00002020) USB FIFO Endpoint [n] */
} USBLC_REGISTERS_Regs;

/*@}*/ /* end of group USBLC_REGISTERS */

/** @addtogroup USBLC_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} USBLC_CPU_INT_Regs;

