subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/*@}*/ /* end of group USBLC_CPU_INT */

/** @addtogroup USBLC_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00000808) Clock control */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} USBLC_GPRCM_Regs;

/*@}*/ /* end of group USBLC_GPRCM */

/** @addtogroup USBLC
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  USBLC_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[514];
  USBLC_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED2[37];
  __I  uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED3[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
  __IO uint32_t USBMODE;                           /* !< (@ 0x00001100) USB mode control */
  __IO uint32_t USBMONITOR;                        /* !< (@ 0x00001104) USB Clock Control Register */
  __IO uint32_t USBDMASEL;                         /* !< (@ 0x00001108) USB DMA trigger select */
       uint32_t RESERVED4[957];
  USBLC_REGISTERS_Regs  REGISTERS;                         /* !< (@ 0x00002000) */
} USBLC_Regs;

/*@}*/ /* end of group USBLC */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* USBLC Register Control Bits
******************************************************************************/

/* USBLC_FADDR Bits */
/* USBLC_FADDR[FUNCADDR] Bits */
#define USBLC_FADDR_FUNCADDR_OFS                 (0)                             /* !< FUNCADDR Offset */
#define USBLC_FADDR_FUNCADDR_MASK                ((uint8_t)0x0000003FU)          /* !< FAddr is an 7-bit register that
                                                                                    should be written with the 7-bit
                                                                                    address of the peripheral part of the
                                                                                    transaction. This register should be
                                                                                    written with the address received
                                                                                    through a SET_ADDRESS command, which
                                                                                    will then be used for decoding the
                                                                                    function address in subsequent token
                                                                                    packets. */
/* USBLC_FADDR[UPDATE] Bits */
#define USBLC_FADDR_UPDATE_OFS                   (7)                             /* !< UPDATE Offset */
#define USBLC_FADDR_UPDATE_MASK                  ((uint8_t)0x00000080U)          /* !< Set when FAddr is written. Cleared
                                                                                    when the new address takes effect (at
                                                                                    the end of the current transfer) */

/* USBLC_POWER Bits */
/* USBLC_POWER[ENSUSPENDM] Bits */
#define USBLC_POWER_ENSUSPENDM_OFS               (0)                             /* !< ENSUSPENDM Offset */
#define USBLC_POWER_ENSUSPENDM_MASK              ((uint8_t)0x00000001U)          /* !< Set by the CPU to enable the
                                                                                    Suspend mode for the USB PHY. */
#define USBLC_POWER_ENSUSPENDM_DISABLE           ((uint8_t)0x00000000U)          /* !< USB PHY is powered */
#define USBLC_POWER_ENSUSPENDM_ENABLE            ((uint8_t)0x00000001U)          /* !< Powers down the internal USB PHY. */
/* USBLC_POWER[SUSPEND] Bits */
#define USBLC_POWER_SUSPEND_OFS                  (1)                             /* !< SUSPEND Offset */
#define USBLC_POWER_SUSPEND_MASK                 ((uint8_t)0x00000002U)          /* !< Set by the USB when Suspend mode is
                                                                                    entered. Cleared when the CPU reads
                                                                                    the interrupt register, or sets the
                                                                                    Resume bit of this register. */
#define USBLC_POWER_SUSPEND_DISABLE              ((uint8_t)0x00000000U)          /* !< Ends SUSPEND signaling */
#define USBLC_POWER_SUSPEND_ENABLE               ((uint8_t)0x00000002U)          /* !< Enables SUSPEND signaling */
/* USBLC_POWER[RESUME] Bits */
#define USBLC_POWER_RESUME_OFS                   (2)                             /* !< RESUME Offset */
#define USBLC_POWER_RESUME_MASK                  ((uint8_t)0x00000004U)          /* !< Set by the CPU to generate Resume
                                                                                    signaling when the device is in
                                                                                    Suspend mode.   The CPU should clear
                                                                                    this bit after 10 ms (a maximum of 15
                                                                                    ms), to end Resume signaling. */
#define USBLC_POWER_RESUME_DISABLE               ((uint8_t)0x00000000U)          /* !< Ends RESUME signaling on the bus. */
#define USBLC_POWER_RESUME_ENABLE                ((uint8_t)0x00000004U)          /* !< Enables RESUME signaling when the
                                                                                    Device is in SUSPEND mode. */
/* USBLC_POWER[RESET] Bits */
#define USBLC_POWER_RESET_OFS                    (3)                             /* !< RESET Offset */
#define USBLC_POWER_RESET_MASK                   ((uint8_t)0x00000008U)          /* !< This bit is set when Reset
                                                                                    signaling is present on the bus. */
#define USBLC_POWER_RESET_DISABLE                ((uint8_t)0x00000000U)          /* !< Ends RESET signaling on the bus. */
#define USBLC_POWER_RESET_ENABLE                 ((uint8_t)0x00000008U)          /* !< Enables RESET signaling on the bus. */
/* USBLC_POWER[ISOUP] Bits */
#define USBLC_POWER_ISOUP_OFS                    (7)                             /* !< ISOUP Offset */
#define USBLC_POWER_ISOUP_MASK                   ((uint8_t)0x00000080U)          /* !< Isochronous Update. When set by the
                                                                                    CPU, the USB controller will wait for
                                                                                    an SOF token from the time TXRDY bit
                                                                                    is set in the USBTXCSRLn before
                                                                                    sending the packet. If an IN token is
                                                                                    received before an SOF token, then a
                                                                                    zero length data packet will be sent. */
#define USBLC_POWER_ISOUP_NO_EFFECT              ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_POWER_ISOUP_WAIT_SOF               ((uint8_t)0x00000080U)          /* !< The USB controller waits for an SOF
                                                                                    token. */

/* USBLC_TXIS Bits */
/* USBLC_TXIS[EP0] Bits */
#define USBLC_TXIS_EP0_OFS                       (0)                             /* !< EP0 Offset */
#define USBLC_TXIS_EP0_MASK                      ((uint8_t)0x00000001U)          /* !< Endpoint 0 Interrupt */
#define USBLC_TXIS_EP0_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_TXIS_EP0_INT                       ((uint8_t)0x00000001U)          /* !< The Endpoint 0 transmit and receive
                                                                                    interrupt is asserted. */
/* USBLC_TXIS[EP1] Bits */
#define USBLC_TXIS_EP1_OFS                       (1)                             /* !< EP1 Offset */
#define USBLC_TXIS_EP1_MASK                      ((uint8_t)0x00000002U)          /* !< TX Endpoint 1 Interrupt */
#define USBLC_TXIS_EP1_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_TXIS_EP1_INT                       ((uint8_t)0x00000002U)          /* !< The Endpoint 1 transmit interrupt
                                                                                    is asserted. */
/* USBLC_TXIS[EP2] Bits */
#define USBLC_TXIS_EP2_OFS                       (2)                             /* !< EP2 Offset */
#define USBLC_TXIS_EP2_MASK                      ((uint8_t)0x00000004U)          /* !< TX Endpoint 2 Interrupt */
#define USBLC_TXIS_EP2_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_TXIS_EP2_INT                       ((uint8_t)0x00000004U)          /* !< The Endpoint 2 transmit interrupt
                                                                                    is asserted. */
/* USBLC_TXIS[EP3] Bits */
#define USBLC_TXIS_EP3_OFS                       (3)                             /* !< EP3 Offset */
#define USBLC_TXIS_EP3_MASK                      ((uint8_t)0x00000008U)          /* !< TX Endpoint 3 Interrupt */
#define USBLC_TXIS_EP3_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_TXIS_EP3_INT                       ((uint8_t)0x00000008U)          /* !< The Endpoint 3 transmit interrupt
                                                                                    is asserted. */

/* USBLC_RXIS Bits */
/* USBLC_RXIS[EP1] Bits */
#define USBLC_RXIS_EP1_OFS                       (1)                             /* !< EP1 Offset */
#define USBLC_RXIS_EP1_MASK                      ((uint8_t)0x00000002U)          /* !< RX Endpoint 1 Interrupt */
#define USBLC_RXIS_EP1_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_RXIS_EP1_INT                       ((uint8_t)0x00000002U)          /* !< The Endpoint 1 transmit interrupt
                                                                                    is asserted. */
/* USBLC_RXIS[EP2] Bits */
#define USBLC_RXIS_EP2_OFS                       (2)                             /* !< EP2 Offset */
#define USBLC_RXIS_EP2_MASK                      ((uint8_t)0x00000004U)          /* !< RX Endpoint 2 Interrupt */
#define USBLC_RXIS_EP2_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_RXIS_EP2_INT                       ((uint8_t)0x00000004U)          /* !< The Endpoint 2 transmit interrupt
                                                                                    is asserted. */
/* USBLC_RXIS[EP3] Bits */
#define USBLC_RXIS_EP3_OFS                       (3)                             /* !< EP3 Offset */
#define USBLC_RXIS_EP3_MASK                      ((uint8_t)0x00000008U)          /* !< RX Endpoint 3 Interrupt */
#define USBLC_RXIS_EP3_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_RXIS_EP3_INT                       ((uint8_t)0x00000008U)          /* !< The Endpoint 3 transmit interrupt
                                                                                    is asserted. */

/* USBLC_USBIS Bits */
/* USBLC_USBIS[SUSPEND] Bits */
#define USBLC_USBIS_SUSPEND_OFS                  (0)                             /* !< SUSPEND Offset */
#define USBLC_USBIS_SUSPEND_MASK                 ((uint8_t)0x00000001U)          /* !< Set when Suspend signaling is
                                                                                    detected on the bus. */
#define USBLC_USBIS_SUSPEND_NO_INT               ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_USBIS_SUSPEND_INT                  ((uint8_t)0x00000001U)          /* !< SUSPEND signaling has been detected
                                                                                    on the bus. */
/* USBLC_USBIS[RESUME] Bits */
#define USBLC_USBIS_RESUME_OFS                   (1)                             /* !< RESUME Offset */
#define USBLC_USBIS_RESUME_MASK                  ((uint8_t)0x00000002U)          /* !< Set when Resume signaling is
                                                                                    detected on the bus while the USB
                                                                                    controller is in Suspend mode. */
#define USBLC_USBIS_RESUME_NO_INT                ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_USBIS_RESUME_INT                   ((uint8_t)0x00000002U)          /* !< RESUME signaling has been detected
                                                                                    on the bus. */
/* USBLC_USBIS[RESET] Bits */
#define USBLC_USBIS_RESET_OFS                    (2)                             /* !< RESET Offset */
#define USBLC_USBIS_RESET_MASK                   ((uint8_t)0x00000004U)          /* !< Set when Reset signaling is
                                                                                    detected on the bus. */
#define USBLC_USBIS_RESET_NO_INT                 ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_USBIS_RESET_INT                    ((uint8_t)0x00000004U)          /* !< RESET / BABBLE signaling has been
                                                                                    detected on the bus. */
/* USBLC_USBIS[SOF] Bits */
#define USBLC_USBIS_SOF_OFS                      (3)                             /* !< SOF Offset */
#define USBLC_USBIS_SOF_MASK                     ((uint8_t)0x00000008U)          /* !< Set at start of each frame. */
#define USBLC_USBIS_SOF_NO_INT                   ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_USBIS_SOF_INT                      ((uint8_t)0x00000008U)          /* !< A new frame has started. */

