subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/* USBLC_TXIE Bits */
/* USBLC_TXIE[EP0] Bits */
#define USBLC_TXIE_EP0_OFS                       (0)                             /* !< EP0 Offset */
#define USBLC_TXIE_EP0_MASK                      ((uint8_t)0x00000001U)          /* !< Endpoint 0 Interrupt Enable */
#define USBLC_TXIE_EP0_DISABLE                   ((uint8_t)0x00000000U)          /* !< The EP1 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USBLC_TXIE_EP0_ENABLE                    ((uint8_t)0x00000001U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP1 bit
                                                                                    in the USBTXIS register is set. */
/* USBLC_TXIE[EP1] Bits */
#define USBLC_TXIE_EP1_OFS                       (1)                             /* !< EP1 Offset */
#define USBLC_TXIE_EP1_MASK                      ((uint8_t)0x00000002U)          /* !< Transmit Endpoint 1 Interrupt
                                                                                    Enable */
#define USBLC_TXIE_EP1_DISABLE                   ((uint8_t)0x00000000U)          /* !< The EP1 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USBLC_TXIE_EP1_ENABLE                    ((uint8_t)0x00000002U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP1 bit
                                                                                    in the USBTXIS register is set. */
/* USBLC_TXIE[EP2] Bits */
#define USBLC_TXIE_EP2_OFS                       (2)                             /* !< EP2 Offset */
#define USBLC_TXIE_EP2_MASK                      ((uint8_t)0x00000004U)          /* !< Transmit Endpoint 2 Interrupt
                                                                                    Enable */
#define USBLC_TXIE_EP2_DISABLE                   ((uint8_t)0x00000000U)          /* !< The EP2 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USBLC_TXIE_EP2_ENABLE                    ((uint8_t)0x00000004U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP2 bit
                                                                                    in the USBTXIS register is set. */
/* USBLC_TXIE[EP3] Bits */
#define USBLC_TXIE_EP3_OFS                       (3)                             /* !< EP3 Offset */
#define USBLC_TXIE_EP3_MASK                      ((uint8_t)0x00000008U)          /* !< Transmit Endpoint 3 Interrupt
                                                                                    Enable */
#define USBLC_TXIE_EP3_DISABLE                   ((uint8_t)0x00000000U)          /* !< The EP3 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USBLC_TXIE_EP3_ENABLE                    ((uint8_t)0x00000008U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP3 bit
                                                                                    in the USBTXIS register is set. */

/* USBLC_RXIE Bits */
/* USBLC_RXIE[EP1] Bits */
#define USBLC_RXIE_EP1_OFS                       (1)                             /* !< EP1 Offset */
#define USBLC_RXIE_EP1_MASK                      ((uint8_t)0x00000002U)          /* !< Recieve Endpoint 1 Interrupt Enable */
#define USBLC_RXIE_EP1_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_RXIE_EP1_INT                       ((uint8_t)0x00000002U)          /* !< The Endpoint 1 transmit interrupt
                                                                                    is asserted. */
/* USBLC_RXIE[EP2] Bits */
#define USBLC_RXIE_EP2_OFS                       (2)                             /* !< EP2 Offset */
#define USBLC_RXIE_EP2_MASK                      ((uint8_t)0x00000004U)          /* !< Recieve Endpoint 2 Interrupt Enable */
#define USBLC_RXIE_EP2_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_RXIE_EP2_INT                       ((uint8_t)0x00000004U)          /* !< The Endpoint 2 transmit interrupt
                                                                                    is asserted. */
/* USBLC_RXIE[EP3] Bits */
#define USBLC_RXIE_EP3_OFS                       (3)                             /* !< EP3 Offset */
#define USBLC_RXIE_EP3_MASK                      ((uint8_t)0x00000008U)          /* !< Recieve Endpoint 3 Interrupt Enable */
#define USBLC_RXIE_EP3_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USBLC_RXIE_EP3_INT                       ((uint8_t)0x00000008U)          /* !< The Endpoint 3 transmit interrupt
                                                                                    is asserted. */

/* USBLC_USBIE Bits */
/* USBLC_USBIE[SUSPEND] Bits */
#define USBLC_USBIE_SUSPEND_OFS                  (0)                             /* !< SUSPEND Offset */
#define USBLC_USBIE_SUSPEND_MASK                 ((uint8_t)0x00000001U)          /* !< Interrupt enable for SUSPEND
                                                                                    signaling detected. */
#define USBLC_USBIE_SUSPEND_DISABLE              ((uint8_t)0x00000000U)          /* !< The SUSPEND interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USBLC_USBIE_SUSPEND_ENABLE               ((uint8_t)0x00000001U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the DISCON
                                                                                    bit in the USBIS register is set. */
/* USBLC_USBIE[RESUME] Bits */
#define USBLC_USBIE_RESUME_OFS                   (1)                             /* !< RESUME Offset */
#define USBLC_USBIE_RESUME_MASK                  ((uint8_t)0x00000002U)          /* !< Interrupt enable for RESUME
                                                                                    signaling detected. */
#define USBLC_USBIE_RESUME_DISABLE               ((uint8_t)0x00000000U)          /* !< The RESUME interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USBLC_USBIE_RESUME_ENABLE                ((uint8_t)0x00000002U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the RESUME
                                                                                    bit in the USBIS register is set. */
/* USBLC_USBIE[RESET] Bits */
#define USBLC_USBIE_RESET_OFS                    (2)                             /* !< RESET Offset */
#define USBLC_USBIE_RESET_MASK                   ((uint8_t)0x00000004U)          /* !< Interrupt enable for RESET
                                                                                    signaling detected. */
#define USBLC_USBIE_RESET_DSIABLE                ((uint8_t)0x00000000U)          /* !< The RESET interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USBLC_USBIE_RESET_ENABLE                 ((uint8_t)0x00000004U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the RESET
                                                                                    bit in the USBIS register is set. */
/* USBLC_USBIE[SOF] Bits */
#define USBLC_USBIE_SOF_OFS                      (3)                             /* !< SOF Offset */
#define USBLC_USBIE_SOF_MASK                     ((uint8_t)0x00000008U)          /* !< Interrupt enable for Start of
                                                                                    frame. */
#define USBLC_USBIE_SOF_DISABLE                  ((uint8_t)0x00000000U)          /* !< The SOF interrupt is suppressed and
                                                                                    not sent to the interrupt controller. */
#define USBLC_USBIE_SOF_ENABLE                   ((uint8_t)0x00000008U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the SOF bit
                                                                                    in the USBIS register is set. */

