subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/* USBLC_FRAMEL Bits */
/* USBLC_FRAMEL[FRAME] Bits */
#define USBLC_FRAMEL_FRAME_OFS                   (0)                             /* !< FRAME Offset */
#define USBLC_FRAMEL_FRAME_MASK                  ((uint8_t)0x000000FFU)          /* !< Frame Number (lower 8-bit) */

/* USBLC_FRAMEH Bits */
/* USBLC_FRAMEH[FRAME] Bits */
#define USBLC_FRAMEH_FRAME_OFS                   (0)                             /* !< FRAME Offset */
#define USBLC_FRAMEH_FRAME_MASK                  ((uint8_t)0x00000007U)          /* !< Frame Number (upper 3-bit) */

/* USBLC_EPINDEX Bits */
/* USBLC_EPINDEX[EPIDX] Bits */
#define USBLC_EPINDEX_EPIDX_OFS                  (0)                             /* !< EPIDX Offset */
#define USBLC_EPINDEX_EPIDX_MASK                 ((uint8_t)0x0000000FU)          /* !< Endpoint Index.  #br#This bit field
                                                                                    configures which endpoint is accessed
                                                                                    when reading or writing to one of the
                                                                                    USB controller's indexed registers. A
                                                                                    value of 0x0 corresponds to Endpoint
                                                                                    0 and a value of 0xF corresponds to
                                                                                    Endpoint 15. */
#define USBLC_EPINDEX_EPIDX_EP0                  ((uint8_t)0x00000000U)          /* !< Select EP0 as indexed register */
#define USBLC_EPINDEX_EPIDX_EP1                  ((uint8_t)0x00000001U)          /* !< Select EP1 as indexed register */
#define USBLC_EPINDEX_EPIDX_EP2                  ((uint8_t)0x00000002U)          /* !< Select EP2 as indexed register */
#define USBLC_EPINDEX_EPIDX_EP3                  ((uint8_t)0x00000003U)          /* !< Select EP3 as indexed register */
#define USBLC_EPINDEX_EPIDX_EP4                  ((uint8_t)0x00000004U)          /* !< Select EP4 as indexed register */
#define USBLC_EPINDEX_EPIDX_EP5                  ((uint8_t)0x00000005U)          /* !< Select EP5 as indexed register */
#define USBLC_EPINDEX_EPIDX_EP6                  ((uint8_t)0x00000006U)          /* !< Select EP6 as indexed register */
#define USBLC_EPINDEX_EPIDX_EP7                  ((uint8_t)0x00000007U)          /* !< Select EP7 as indexed register */

/* USBLC_IDXTXMAXP Bits */
/* USBLC_IDXTXMAXP[MAXLOAD] Bits */
#define USBLC_IDXTXMAXP_MAXLOAD_OFS              (0)                             /* !< MAXLOAD Offset */
#define USBLC_IDXTXMAXP_MAXLOAD_MASK             ((uint8_t)0x000000FFU)          /* !< Maximum Payload specifies the
                                                                                    maximum payload in bytes per
                                                                                    transaction. */

/* USBLC_IDXTXCSRL Bits */
/* USBLC_IDXTXCSRL[TXRDY] Bits */
#define USBLC_IDXTXCSRL_TXRDY_OFS                (0)                             /* !< TXRDY Offset */
#define USBLC_IDXTXCSRL_TXRDY_MASK               ((uint8_t)0x00000001U)          /* !< Transmit Packet Ready. The CPU sets
                                                                                    this bit after loading a data packet
                                                                                    into the FIFO.  This bit is cleared
                                                                                    automatically when a data packet has
                                                                                    been transmitted. The EPn bit in the
                                                                                    USBTXIS register is also set at this
                                                                                    point. TXRDY is also automatically
                                                                                    cleared prior to loading a second
                                                                                    packet into a double-buffered FIFO.
                                                                                    Note: Host and device mode */
#define USBLC_IDXTXCSRL_TXRDY_WAIT               ((uint8_t)0x00000000U)          /* !< No transmit packet is ready. */
#define USBLC_IDXTXCSRL_TXRDY_READY              ((uint8_t)0x00000001U)          /* !< Software sets this bit after
                                                                                    loading a data packet into the TX
                                                                                    FIFO. */
/* USBLC_IDXTXCSRL[FIFONE] Bits */
#define USBLC_IDXTXCSRL_FIFONE_OFS               (1)                             /* !< FIFONE Offset */
#define USBLC_IDXTXCSRL_FIFONE_MASK              ((uint8_t)0x00000002U)          /* !< FIFO Not Empty. The USB controller
                                                                                    sets this bit when there is at least
                                                                                    1 packet in the TX FIFO. Note: Host
                                                                                    and device mode. */
#define USBLC_IDXTXCSRL_FIFONE_EMPTY             ((uint8_t)0x00000000U)          /* !< The FIFO is empty */
#define USBLC_IDXTXCSRL_FIFONE_NOT_EMPTY         ((uint8_t)0x00000002U)          /* !< At least one packet is in the
                                                                                    transmit FIFO. */
/* USBLC_IDXTXCSRL[UNDERRUN] Bits */
#define USBLC_IDXTXCSRL_UNDERRUN_OFS             (2)                             /* !< UNDERRUN Offset */
#define USBLC_IDXTXCSRL_UNDERRUN_MASK            ((uint8_t)0x00000004U)          /* !< Underrun In ISO mode, this bit is
                                                                                    set when a zero length data packet is
                                                                                    sent after receiving an IN token with
                                                                                    the TXRDY bit not set. In
                                                                                    Bulk/Interrupt mode, this bit is set
                                                                                    when a NAK is returned in response to
                                                                                    an IN token. The CPU should clear
                                                                                    this bit. */
#define USBLC_IDXTXCSRL_UNDERRUN_CLEAR           ((uint8_t)0x00000000U)          /* !< No underrun or error condition */
#define USBLC_IDXTXCSRL_UNDERRUN_SET             ((uint8_t)0x00000004U)          /* !< Underrun or error condition exist. */
/* USBLC_IDXTXCSRL[FLUSH] Bits */
#define USBLC_IDXTXCSRL_FLUSH_OFS                (3)                             /* !< FLUSH Offset */
#define USBLC_IDXTXCSRL_FLUSH_MASK               ((uint8_t)0x00000008U)          /* !< Flush FIFO. The CPU writes a 1 to
                                                                                    this bit to flush the latest packet
                                                                                    from the endpoint TX FIFO. The FIFO
                                                                                    pointer is reset, the TXRDY bit is
                                                                                    cleared and an interrupt is
                                                                                    generated. May be set simultaneously
                                                                                    with TXRDY to abort the packet that
                                                                                    is currently being loaded into the
                                                                                    FIFO.  Note: FLUSH should only be
                                                                                    used when TXRDY is set. At other
                                                                                    times, it may cause data to be
                                                                                    corrupted. Also note that, if the
                                                                                    FIFO is double-buffered, FLUSH may
                                                                                    need to be set twice to completely
                                                                                    clear the FIFO. */
#define USBLC_IDXTXCSRL_FLUSH_NO_EFFECT          ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXTXCSRL_FLUSH_EFFECT             ((uint8_t)0x00000008U)          /* !< Flushes the latest packet from the
                                                                                    endpoint transmit FIFO. */
/* USBLC_IDXTXCSRL[STALL] Bits */
#define USBLC_IDXTXCSRL_STALL_OFS                (4)                             /* !< STALL Offset */
#define USBLC_IDXTXCSRL_STALL_MASK               ((uint8_t)0x00000010U)          /* !< Send stall The CPU writes a 1 to
                                                                                    this bit to issue a STALL handshake
                                                                                    to an IN token. The CPU clears this
                                                                                    bit to terminate the stall condition.
                                                                                    Note: This bit has no effect where
                                                                                    the TX endpoint is being used for
                                                                                    Isochronous transfers. */
#define USBLC_IDXTXCSRL_STALL_CLEAR              ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXTXCSRL_STALL_SET                ((uint8_t)0x00000010U)          /* !< Send stall or setup packet request. */
/* USBLC_IDXTXCSRL[STALLED] Bits */
#define USBLC_IDXTXCSRL_STALLED_OFS              (5)                             /* !< STALLED Offset */
#define USBLC_IDXTXCSRL_STALLED_MASK             ((uint8_t)0x00000020U)          /* !< Sent stall This bit is set when a
                                                                                    STALL handshake is transmitted. The
                                                                                    FIFO is flushed and the TXRDY bit is
                                                                                    cleared. The CPU should clear this
                                                                                    bit. */
#define USBLC_IDXTXCSRL_STALLED_CLEAR            ((uint8_t)0x00000000U)          /* !< Clear stall indication. */
#define USBLC_IDXTXCSRL_STALLED_SET              ((uint8_t)0x00000020U)          /* !< Indicates that a STALL handshake
                                                                                    has been sent or received. */
/* USBLC_IDXTXCSRL[CLRDT] Bits */
#define USBLC_IDXTXCSRL_CLRDT_OFS                (6)                             /* !< CLRDT Offset */
#define USBLC_IDXTXCSRL_CLRDT_MASK               ((uint8_t)0x00000040U)          /* !< Clear DataToggle. The CPU writes a
                                                                                    1 to this bit to reset the endpoint
                                                                                    data toggle to 0. */
#define USBLC_IDXTXCSRL_CLRDT_NO_EFFECT          ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXTXCSRL_CLRDT_EFFECT             ((uint8_t)0x00000040U)          /* !< Writing a 1 to this bit clears the
                                                                                    DT bit in the USBTXCSRH[n] register. */

