subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/* USBLC_IDXTXCSRH Bits */
/* USBLC_IDXTXCSRH[FDT] Bits */
#define USBLC_IDXTXCSRH_FDT_OFS                  (3)                             /* !< FDT Offset */
#define USBLC_IDXTXCSRH_FDT_MASK                 ((uint8_t)0x00000008U)          /* !< Force Data Toggle. The CPU sets
                                                                                    this bit to force the endpoints TX
                                                                                    data toggle to switch after each data
                                                                                    packet is sent regardless of whether
                                                                                    an ACK was received. This can be used
                                                                                    by interrupt TX endpoints which are
                                                                                    used to communicate rate feedback for
                                                                                    Isochronous endpoints. */
#define USBLC_IDXTXCSRH_FDT_NO_EFFECT            ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXTXCSRH_FDT_EFFECT               ((uint8_t)0x00000008U)          /* !< Forces data toggle */
/* USBLC_IDXTXCSRH[DMAEN] Bits */
#define USBLC_IDXTXCSRH_DMAEN_OFS                (4)                             /* !< DMAEN Offset */
#define USBLC_IDXTXCSRH_DMAEN_MASK               ((uint8_t)0x00000010U)          /* !< DMA Request Enable The CPU sets
                                                                                    this bit to enable the DMA request
                                                                                    for the TX endpoint. */
#define USBLC_IDXTXCSRH_DMAEN_DISABLE            ((uint8_t)0x00000000U)          /* !< Disables the DMA request for the
                                                                                    transmit endpoint. */
#define USBLC_IDXTXCSRH_DMAEN_ENABLE             ((uint8_t)0x00000010U)          /* !< Enables the DMA request for the
                                                                                    transmit endpoint. */
/* USBLC_IDXTXCSRH[MODE] Bits */
#define USBLC_IDXTXCSRH_MODE_OFS                 (5)                             /* !< MODE Offset */
#define USBLC_IDXTXCSRH_MODE_MASK                ((uint8_t)0x00000020U)          /* !< Mode The CPU sets this bit to
                                                                                    enable the endpoint direction as TX,
                                                                                    and clears the bit to enable it as
                                                                                    RX.  Note: This bit only has an
                                                                                    effect when the same endpoint FIFO is
                                                                                    used for both transmit and receive
                                                                                    transactions. */
#define USBLC_IDXTXCSRH_MODE_RX                  ((uint8_t)0x00000000U)          /* !< Enables the endpoint direction as
                                                                                    RX. */
#define USBLC_IDXTXCSRH_MODE_TX                  ((uint8_t)0x00000020U)          /* !< Enables the endpoint direction as
                                                                                    TX. */
/* USBLC_IDXTXCSRH[ISO] Bits */
#define USBLC_IDXTXCSRH_ISO_OFS                  (6)                             /* !< ISO Offset */
#define USBLC_IDXTXCSRH_ISO_MASK                 ((uint8_t)0x00000040U)          /* !< Isochronous Transfers. The CPU sets
                                                                                    this bit to enable the TX endpoint
                                                                                    for Isochronous transfers, and clears
                                                                                    it to enable the TX endpoint for Bulk
                                                                                    or Interrupt transfers. */
#define USBLC_IDXTXCSRH_ISO_BULK_INT_TRANSFER    ((uint8_t)0x00000000U)          /* !< Enables the transmit endpoint for
                                                                                    bulk or interrupt transfers. */
#define USBLC_IDXTXCSRH_ISO_ISO_TRANSFER         ((uint8_t)0x00000040U)          /* !< Enables the transmit endpoint for
                                                                                    isochronous transfers. */
/* USBLC_IDXTXCSRH[AUTOSET] Bits */
#define USBLC_IDXTXCSRH_AUTOSET_OFS              (7)                             /* !< AUTOSET Offset */
#define USBLC_IDXTXCSRH_AUTOSET_MASK             ((uint8_t)0x00000080U)          /* !< Auto Set. If the CPU sets this bit,
                                                                                    the TXRDY bit will be be
                                                                                    automatically set when data of the
                                                                                    maximum packet size (value in
                                                                                    IDXTXMAXP) is loaded into the
                                                                                    transmit FIFO. If a packet of less
                                                                                    than the maximum packet size is
                                                                                    loaded, then the TXRDY bit must be
                                                                                    set manually. Note: Should not be set
                                                                                    for either high-bandwidth Isochronous
                                                                                    endpoints or high-bandwidth Interrupt
                                                                                    endpoints. */
#define USBLC_IDXTXCSRH_AUTOSET_MANUAL           ((uint8_t)0x00000000U)          /* !< The TXRDY bit must be set manually. */
#define USBLC_IDXTXCSRH_AUTOSET_AUTO             ((uint8_t)0x00000080U)          /* !< The TXRDY bit is automatically set
                                                                                    when maximum packet size is loaded
                                                                                    into the TX FIFO. */

/* USBLC_IDXRXMAXP Bits */
/* USBLC_IDXRXMAXP[MAXLOAD] Bits */
#define USBLC_IDXRXMAXP_MAXLOAD_OFS              (0)                             /* !< MAXLOAD Offset */
#define USBLC_IDXRXMAXP_MAXLOAD_MASK             ((uint8_t)0x000000FFU)          /* !< Maximum Payload specifies the
                                                                                    maximum payload in bytes per
                                                                                    transaction. */

/* USBLC_IDXRXCSRL Bits */
/* USBLC_IDXRXCSRL[RXRDY] Bits */
#define USBLC_IDXRXCSRL_RXRDY_OFS                (0)                             /* !< RXRDY Offset */
#define USBLC_IDXRXCSRL_RXRDY_MASK               ((uint8_t)0x00000001U)          /* !< Receive Packet Ready. This bit is
                                                                                    set when a data packet has been
                                                                                    received. The CPU should clear this
                                                                                    bit when the packet has been unloaded
                                                                                    from the Rx FIFO. An interrupt is
                                                                                    generated when the bit is set. If the
                                                                                    AUTOCLR bit in the IDXRXCSRH register
                                                                                    is set, then the this bit is
                                                                                    automatically cleared when a packet
                                                                                    of IDXRXMAXP bytes has been unloaded
                                                                                    from the receive FIFO. If the AUTOCLR
                                                                                    bit is clear, or if packets of less
                                                                                    than the maximum packet size are
                                                                                    unloaded, then software must clear
                                                                                    this bit manually when the packet has
                                                                                    been unloaded from the receive FIFO. */
#define USBLC_IDXRXCSRL_RXRDY_WAIT               ((uint8_t)0x00000000U)          /* !< No data packet has been received. */
#define USBLC_IDXRXCSRL_RXRDY_READY              ((uint8_t)0x00000001U)          /* !< Indicates that a data packet has
                                                                                    been received. The EP[j] bit in the
                                                                                    USBTXIS register is also set in this
                                                                                    situation */
/* USBLC_IDXRXCSRL[FULL] Bits */
#define USBLC_IDXRXCSRL_FULL_OFS                 (1)                             /* !< FULL Offset */
#define USBLC_IDXRXCSRL_FULL_MASK                ((uint8_t)0x00000002U)          /* !< FIFO Full. This bit is set when no
                                                                                    more packets can be loaded into the
                                                                                    RX FIFO. */
#define USBLC_IDXRXCSRL_FULL_NO                  ((uint8_t)0x00000000U)          /* !< The receive FIFO is not full. */
#define USBLC_IDXRXCSRL_FULL_YES                 ((uint8_t)0x00000002U)          /* !< The receive FIFO is full. No more
                                                                                    packets can be loaded into the
                                                                                    receive FIFO. */
/* USBLC_IDXRXCSRL[OVERRUN] Bits */
#define USBLC_IDXRXCSRL_OVERRUN_OFS              (2)                             /* !< OVERRUN Offset */
#define USBLC_IDXRXCSRL_OVERRUN_MASK             ((uint8_t)0x00000004U)          /* !< Over run Over run - This bit is set
                                                                                    if an RX packet cannot be loaded into
                                                                                    the receive FIFO. The CPU should
                                                                                    clear this bit. - Note: This bit is
                                                                                    only valid when the endpoint is
                                                                                    operating in ISO mode. In Bulk mode,
                                                                                    it always returns zero. */
#define USBLC_IDXRXCSRL_OVERRUN_CLEAR            ((uint8_t)0x00000000U)          /* !< No over run or error condition. */
#define USBLC_IDXRXCSRL_OVERRUN_SET              ((uint8_t)0x00000004U)          /* !< Under run or error condition exist. */
/* USBLC_IDXRXCSRL[DATAERR] Bits */
#define USBLC_IDXRXCSRL_DATAERR_OFS              (3)                             /* !< DATAERR Offset */
#define USBLC_IDXRXCSRL_DATAERR_MASK             ((uint8_t)0x00000008U)          /* !< Data Error This bit is set when
                                                                                    RXRDY is set, if the data packet has
                                                                                    a CRC or bit-stuff error. It is
                                                                                    cleared when RXRDY is cleared. -
                                                                                    Note: This bit is only valid when the
                                                                                    endpoint is operating in ISO mode. In
                                                                                    Bulk mode, it always returns zero. */
#define USBLC_IDXRXCSRL_DATAERR_CLEAR            ((uint8_t)0x00000000U)          /* !< Normal operation */
#define USBLC_IDXRXCSRL_DATAERR_SET              ((uint8_t)0x00000008U)          /* !< Data error or NAK Timeout condition
                                                                                    exist. */
/* USBLC_IDXRXCSRL[FLUSH] Bits */
#define USBLC_IDXRXCSRL_FLUSH_OFS                (4)                             /* !< FLUSH Offset */
#define USBLC_IDXRXCSRL_FLUSH_MASK               ((uint8_t)0x00000010U)          /* !< Flush FIFO. The CPU writes a 1 to
                                                                                    this bit to flush the next packet to
                                                                                    be read from the endpoint RX FIFO.
                                                                                    The FIFO pointer is reset and the
                                                                                    RXRDY bit is cleared.  Note: Thsi bit
                                                                                    should only be set when RXRDY is set.
                                                                                    At other times, it may cause data to
                                                                                    be corrupted.  Note: If the FIFO is
                                                                                    double-buffered, FLUSH may need to be
                                                                                    set twice to completely clear the
                                                                                    FIFO. Note: Device and host mode. */
#define USBLC_IDXRXCSRL_FLUSH_NO_EFFECT          ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXRXCSRL_FLUSH_EFFECT             ((uint8_t)0x00000010U)          /* !< Flushes the next packet to be read
                                                                                    from the endpoint receive FIFO. The
                                                                                    FIFO pointer is reset and the RXRDY
                                                                                    bit is cleared */
/* USBLC_IDXRXCSRL[STALL] Bits */
#define USBLC_IDXRXCSRL_STALL_OFS                (5)                             /* !< STALL Offset */
#define USBLC_IDXRXCSRL_STALL_MASK               ((uint8_t)0x00000020U)          /* !< Send Stall The CPU writes a 1 to
                                                                                    this bit to issue a STALL handshake.
                                                                                    The CPU clears this bit to terminate
                                                                                    the stall condition. - Note: This bit
                                                                                    has no effect where the endpoint is
                                                                                    being used for Isochronous transfers. */
#define USBLC_IDXRXCSRL_STALL_CLEAR              ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXRXCSRL_STALL_SET                ((uint8_t)0x00000020U)          /* !< Send stall or packet request. */
/* USBLC_IDXRXCSRL[STALLED] Bits */
#define USBLC_IDXRXCSRL_STALLED_OFS              (6)                             /* !< STALLED Offset */
#define USBLC_IDXRXCSRL_STALLED_MASK             ((uint8_t)0x00000040U)          /* !< Stall Sent  This bit is set when a
                                                                                    STALL handshake is transmitted. The
                                                                                    CPU should clear this bit. */
#define USBLC_IDXRXCSRL_STALLED_STALLED_WAIT     ((uint8_t)0x00000000U)          /* !< No handshake has been received. */
#define USBLC_IDXRXCSRL_STALLED_STALLED_RECEIVE  ((uint8_t)0x00000040U)          /* !< A STALL handshake has been
                                                                                    received. The EPn bit in the USBRXIS
                                                                                    register is also set. */
/* USBLC_IDXRXCSRL[CLRDT] Bits */
#define USBLC_IDXRXCSRL_CLRDT_OFS                (7)                             /* !< CLRDT Offset */
#define USBLC_IDXRXCSRL_CLRDT_MASK               ((uint8_t)0x00000080U)          /* !< Clear Data Toggle. The CPU writes a
                                                                                    1 to this bit to reset the endpoint
                                                                                    data toggle to 0. */
#define USBLC_IDXRXCSRL_CLRDT_NO_EFFECT          ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXRXCSRL_CLRDT_EFFECT             ((uint8_t)0x00000080U)          /* !< Writing a 1 to this bit clears the
                                                                                    DT bit in the USBRXCSRH[n] register. */

