subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/* USBLC_IDXRXCSRH Bits */
/* USBLC_IDXRXCSRH[DMAMOD] Bits */
#define USBLC_IDXRXCSRH_DMAMOD_OFS               (4)                             /* !< DMAMOD Offset */
#define USBLC_IDXRXCSRH_DMAMOD_MASK              ((uint8_t)0x00000010U)          /* !< DMA request mode Two modes of DMA
                                                                                    operation are supported: DMA Mode 0
                                                                                    in which a DMA request is generated
                                                                                    for all received packets, together
                                                                                    with an interrupt (if enabled); and
                                                                                    DMA Mode 1 in which a DMA request
                                                                                    (but no interrupt) is generated for
                                                                                    RX packets of size RXMAXP bytes and
                                                                                    an interrupt (but no DMA request) is
                                                                                    generated for RX packets of any other
                                                                                    size. The CPU sets this bit to select
                                                                                    DMA Mode 1 and clears this bit to
                                                                                    select DMA Mode 0. */
#define USBLC_IDXRXCSRH_DMAMOD_MODE0             ((uint8_t)0x00000000U)          /* !< An interrupt is generated after
                                                                                    every DMA packet transfer. */
#define USBLC_IDXRXCSRH_DMAMOD_MODE1             ((uint8_t)0x00000010U)          /* !< An interrupt is generated only
                                                                                    after the entire DMA transfer is
                                                                                    complete. */
/* USBLC_IDXRXCSRH[DMAEN] Bits */
#define USBLC_IDXRXCSRH_DMAEN_OFS                (5)                             /* !< DMAEN Offset */
#define USBLC_IDXRXCSRH_DMAEN_MASK               ((uint8_t)0x00000020U)          /* !< DMA Request Enable The CPU sets
                                                                                    this bit to enable the DMA request
                                                                                    for the RX endpoint. */
#define USBLC_IDXRXCSRH_DMAEN_DISABLE            ((uint8_t)0x00000000U)          /* !< Disables the DMA request for the
                                                                                    receive endpoint. */
#define USBLC_IDXRXCSRH_DMAEN_ENABLE             ((uint8_t)0x00000020U)          /* !< Enables the DMA request for the
                                                                                    receive endpoint. */
/* USBLC_IDXRXCSRH[ISO] Bits */
#define USBLC_IDXRXCSRH_ISO_OFS                  (6)                             /* !< ISO Offset */
#define USBLC_IDXRXCSRH_ISO_MASK                 ((uint8_t)0x00000040U)          /* !< Isochronous transfer mode The CPU
                                                                                    sets this bit to enable the RX
                                                                                    endpoint for Isochronous transfers,
                                                                                    and clears it to enable the RX
                                                                                    endpoint for Bulk/Interrupt
                                                                                    transfers. */
#define USBLC_IDXRXCSRH_ISO_DISABLE              ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXRXCSRH_ISO_ENABLE               ((uint8_t)0x00000040U)          /* !< Sets ISO transfer mode or enables
                                                                                    the REQPKT bit to be automatically
                                                                                    set when the RXRDY bit is cleared. */
/* USBLC_IDXRXCSRH[AUTOCLR] Bits */
#define USBLC_IDXRXCSRH_AUTOCLR_OFS              (7)                             /* !< AUTOCLR Offset */
#define USBLC_IDXRXCSRH_AUTOCLR_MASK             ((uint8_t)0x00000080U)          /* !< Auto Clear. If the CPU sets this
                                                                                    bit then the RXRDY bit will be
                                                                                    automatically cleared when a packet
                                                                                    of RXMAXP bytes has been unloaded
                                                                                    from the RX FIFO. When packets of
                                                                                    less than the maximum packet size are
                                                                                    unloaded, RXRDY will have to be
                                                                                    cleared manually. When using a DMA to
                                                                                    unload the RX-FIFO, data is read from
                                                                                    the RX-FIFO in 4 byte chunks
                                                                                    regardless of the RXMAXP setting. */
#define USBLC_IDXRXCSRH_AUTOCLR_DSIABLE          ((uint8_t)0x00000000U)          /* !< No effect */
#define USBLC_IDXRXCSRH_AUTOCLR_ENABLE           ((uint8_t)0x00000080U)          /* !< Enables the RXRDY bit to be
                                                                                    automatically cleared when a packet
                                                                                    of USBRXMAXP[n] bytes has been
                                                                                    unloaded from the receive FIFO. */

/* USBLC_IDXRXCOUNTL Bits */
/* USBLC_IDXRXCOUNTL[COUNT] Bits */
#define USBLC_IDXRXCOUNTL_COUNT_OFS              (0)                             /* !< COUNT Offset */
#define USBLC_IDXRXCOUNTL_COUNT_MASK             ((uint8_t)0x000000FFU)          /* !< Receive Packet Count indicates the
                                                                                    number of bytes in the receive
                                                                                    packet. */

/* USBLC_IDXRXCOUNTH Bits */
/* USBLC_IDXRXCOUNTH[COUNT] Bits */
#define USBLC_IDXRXCOUNTH_COUNT_OFS              (0)                             /* !< COUNT Offset */
#define USBLC_IDXRXCOUNTH_COUNT_MASK             ((uint8_t)0x00000007U)          /* !< Receive Packet Count indicates the
                                                                                    number of bytes in the receive
                                                                                    packet. */

/* USBLC_FIFO Bits */
/* USBLC_FIFO[EPDATA] Bits */
#define USBLC_FIFO_EPDATA_OFS                    (0)                             /* !< EPDATA Offset */
#define USBLC_FIFO_EPDATA_MASK                   ((uint8_t)0x000000FFU)          /* !< Endpoint Data. Writing to this
                                                                                    register loads the data into the
                                                                                    Transmit FIFO and reading unloads
                                                                                    data from the Receive FIFO. */

/* USBLC_IIDX Bits */
/* USBLC_IIDX[STAT] Bits */
#define USBLC_IIDX_STAT_OFS                      (0)                             /* !< STAT Offset */
#define USBLC_IIDX_STAT_MASK                     ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define USBLC_IIDX_STAT_NO_INTR                  ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define USBLC_IIDX_STAT_INTRTX                   ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USBLC_IIDX_STAT_INTRRX                   ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USBLC_IIDX_STAT_INTRUSB                  ((uint32_t)0x00000003U)         /* !< USB Interrupts */
#define USBLC_IIDX_STAT_VUSBPWRDN                ((uint32_t)0x00000004U)         /* !< VUSB power down */
#define USBLC_IIDX_STAT_DMADONEARX               ((uint32_t)0x00000005U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_IIDX_STAT_DMADONEATX               ((uint32_t)0x00000006U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_IIDX_STAT_DMADONEBRX               ((uint32_t)0x00000007U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_IIDX_STAT_DMADONEBTX               ((uint32_t)0x00000008U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_IIDX_STAT_DMADONECRX               ((uint32_t)0x00000009U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_IIDX_STAT_DMADONECTX               ((uint32_t)0x0000000AU)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_IIDX_STAT_DMADONEDRX               ((uint32_t)0x0000000BU)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_IIDX_STAT_DMADONEDTX               ((uint32_t)0x0000000CU)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_IIDX_STAT_DMAPREARX                ((uint32_t)0x0000000DU)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_IIDX_STAT_DMAPREATX                ((uint32_t)0x0000000EU)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_IIDX_STAT_DMAPREBRX                ((uint32_t)0x0000000FU)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_IIDX_STAT_DMAPREBTX                ((uint32_t)0x00000010U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_IIDX_STAT_DMAPRECRX                ((uint32_t)0x00000011U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_IIDX_STAT_DMAPRECTX                ((uint32_t)0x00000012U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_IIDX_STAT_DMAPREDRX                ((uint32_t)0x00000013U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_IIDX_STAT_DMAPREDTX                ((uint32_t)0x00000014U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */

