subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/* USBLC_IMASK Bits */
/* USBLC_IMASK[INTRTX] Bits */
#define USBLC_IMASK_INTRTX_OFS                   (0)                             /* !< INTRTX Offset */
#define USBLC_IMASK_INTRTX_MASK                  ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USBLC_IMASK_INTRTX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_INTRTX_SET                   ((uint32_t)0x00000001U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[INTRRX] Bits */
#define USBLC_IMASK_INTRRX_OFS                   (1)                             /* !< INTRRX Offset */
#define USBLC_IMASK_INTRRX_MASK                  ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USBLC_IMASK_INTRRX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_INTRRX_SET                   ((uint32_t)0x00000002U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[INTRUSB] Bits */
#define USBLC_IMASK_INTRUSB_OFS                  (2)                             /* !< INTRUSB Offset */
#define USBLC_IMASK_INTRUSB_MASK                 ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USBLC_IMASK_INTRUSB_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_INTRUSB_SET                  ((uint32_t)0x00000004U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[VUSBPWRDN] Bits */
#define USBLC_IMASK_VUSBPWRDN_OFS                (3)                             /* !< VUSBPWRDN Offset */
#define USBLC_IMASK_VUSBPWRDN_MASK               ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USBLC_IMASK_VUSBPWRDN_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_VUSBPWRDN_SET                ((uint32_t)0x00000008U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONEARX] Bits */
#define USBLC_IMASK_DMADONEARX_OFS               (4)                             /* !< DMADONEARX Offset */
#define USBLC_IMASK_DMADONEARX_MASK              ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_IMASK_DMADONEARX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONEARX_SET               ((uint32_t)0x00000010U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONEATX] Bits */
#define USBLC_IMASK_DMADONEATX_OFS               (5)                             /* !< DMADONEATX Offset */
#define USBLC_IMASK_DMADONEATX_MASK              ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_IMASK_DMADONEATX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONEATX_SET               ((uint32_t)0x00000020U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONEBRX] Bits */
#define USBLC_IMASK_DMADONEBRX_OFS               (6)                             /* !< DMADONEBRX Offset */
#define USBLC_IMASK_DMADONEBRX_MASK              ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_IMASK_DMADONEBRX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONEBRX_SET               ((uint32_t)0x00000040U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONEBTX] Bits */
#define USBLC_IMASK_DMADONEBTX_OFS               (7)                             /* !< DMADONEBTX Offset */
#define USBLC_IMASK_DMADONEBTX_MASK              ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_IMASK_DMADONEBTX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONEBTX_SET               ((uint32_t)0x00000080U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONECRX] Bits */
#define USBLC_IMASK_DMADONECRX_OFS               (8)                             /* !< DMADONECRX Offset */
#define USBLC_IMASK_DMADONECRX_MASK              ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_IMASK_DMADONECRX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONECRX_SET               ((uint32_t)0x00000100U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONECTX] Bits */
#define USBLC_IMASK_DMADONECTX_OFS               (9)                             /* !< DMADONECTX Offset */
#define USBLC_IMASK_DMADONECTX_MASK              ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_IMASK_DMADONECTX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONECTX_SET               ((uint32_t)0x00000200U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONEDRX] Bits */
#define USBLC_IMASK_DMADONEDRX_OFS               (10)                            /* !< DMADONEDRX Offset */
#define USBLC_IMASK_DMADONEDRX_MASK              ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_IMASK_DMADONEDRX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONEDRX_SET               ((uint32_t)0x00000400U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMADONEDTX] Bits */
#define USBLC_IMASK_DMADONEDTX_OFS               (11)                            /* !< DMADONEDTX Offset */
#define USBLC_IMASK_DMADONEDTX_MASK              ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_IMASK_DMADONEDTX_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMADONEDTX_SET               ((uint32_t)0x00000800U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPREARX] Bits */
#define USBLC_IMASK_DMAPREARX_OFS                (12)                            /* !< DMAPREARX Offset */
#define USBLC_IMASK_DMAPREARX_MASK               ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_IMASK_DMAPREARX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPREARX_SET                ((uint32_t)0x00001000U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPREATX] Bits */
#define USBLC_IMASK_DMAPREATX_OFS                (13)                            /* !< DMAPREATX Offset */
#define USBLC_IMASK_DMAPREATX_MASK               ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_IMASK_DMAPREATX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPREATX_SET                ((uint32_t)0x00002000U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPREBRX] Bits */
#define USBLC_IMASK_DMAPREBRX_OFS                (14)                            /* !< DMAPREBRX Offset */
#define USBLC_IMASK_DMAPREBRX_MASK               ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_IMASK_DMAPREBRX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPREBRX_SET                ((uint32_t)0x00004000U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPREBTX] Bits */
#define USBLC_IMASK_DMAPREBTX_OFS                (15)                            /* !< DMAPREBTX Offset */
#define USBLC_IMASK_DMAPREBTX_MASK               ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_IMASK_DMAPREBTX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPREBTX_SET                ((uint32_t)0x00008000U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPRECRX] Bits */
#define USBLC_IMASK_DMAPRECRX_OFS                (16)                            /* !< DMAPRECRX Offset */
#define USBLC_IMASK_DMAPRECRX_MASK               ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_IMASK_DMAPRECRX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPRECRX_SET                ((uint32_t)0x00010000U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPRECTX] Bits */
#define USBLC_IMASK_DMAPRECTX_OFS                (17)                            /* !< DMAPRECTX Offset */
#define USBLC_IMASK_DMAPRECTX_MASK               ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_IMASK_DMAPRECTX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPRECTX_SET                ((uint32_t)0x00020000U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPREDRX] Bits */
#define USBLC_IMASK_DMAPREDRX_OFS                (18)                            /* !< DMAPREDRX Offset */
#define USBLC_IMASK_DMAPREDRX_MASK               ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_IMASK_DMAPREDRX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPREDRX_SET                ((uint32_t)0x00040000U)         /* !< Interrupt Enabled. */
/* USBLC_IMASK[DMAPREDTX] Bits */
#define USBLC_IMASK_DMAPREDTX_OFS                (19)                            /* !< DMAPREDTX Offset */
#define USBLC_IMASK_DMAPREDTX_MASK               ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_IMASK_DMAPREDTX_CLR                ((uint32_t)0x00000000U)         /* !< Interrupt Disabled. */
#define USBLC_IMASK_DMAPREDTX_SET                ((uint32_t)0x00080000U)         /* !< Interrupt Enabled. */

