subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/* USBLC_RIS Bits */
/* USBLC_RIS[INTRTX] Bits */
#define USBLC_RIS_INTRTX_OFS                     (0)                             /* !< INTRTX Offset */
#define USBLC_RIS_INTRTX_MASK                    ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USBLC_RIS_INTRTX_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_INTRTX_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* USBLC_RIS[INTRRX] Bits */
#define USBLC_RIS_INTRRX_OFS                     (1)                             /* !< INTRRX Offset */
#define USBLC_RIS_INTRRX_MASK                    ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USBLC_RIS_INTRRX_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_INTRRX_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* USBLC_RIS[INTRUSB] Bits */
#define USBLC_RIS_INTRUSB_OFS                    (2)                             /* !< INTRUSB Offset */
#define USBLC_RIS_INTRUSB_MASK                   ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USBLC_RIS_INTRUSB_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_INTRUSB_SET                    ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* USBLC_RIS[VUSBPWRDN] Bits */
#define USBLC_RIS_VUSBPWRDN_OFS                  (3)                             /* !< VUSBPWRDN Offset */
#define USBLC_RIS_VUSBPWRDN_MASK                 ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USBLC_RIS_VUSBPWRDN_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_VUSBPWRDN_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONEARX] Bits */
#define USBLC_RIS_DMADONEARX_OFS                 (4)                             /* !< DMADONEARX Offset */
#define USBLC_RIS_DMADONEARX_MASK                ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_RIS_DMADONEARX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONEARX_SET                 ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONEATX] Bits */
#define USBLC_RIS_DMADONEATX_OFS                 (5)                             /* !< DMADONEATX Offset */
#define USBLC_RIS_DMADONEATX_MASK                ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_RIS_DMADONEATX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONEATX_SET                 ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONEBRX] Bits */
#define USBLC_RIS_DMADONEBRX_OFS                 (6)                             /* !< DMADONEBRX Offset */
#define USBLC_RIS_DMADONEBRX_MASK                ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_RIS_DMADONEBRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONEBRX_SET                 ((uint32_t)0x00000040U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONEBTX] Bits */
#define USBLC_RIS_DMADONEBTX_OFS                 (7)                             /* !< DMADONEBTX Offset */
#define USBLC_RIS_DMADONEBTX_MASK                ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_RIS_DMADONEBTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONEBTX_SET                 ((uint32_t)0x00000080U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONECRX] Bits */
#define USBLC_RIS_DMADONECRX_OFS                 (8)                             /* !< DMADONECRX Offset */
#define USBLC_RIS_DMADONECRX_MASK                ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_RIS_DMADONECRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONECRX_SET                 ((uint32_t)0x00000100U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONECTX] Bits */
#define USBLC_RIS_DMADONECTX_OFS                 (9)                             /* !< DMADONECTX Offset */
#define USBLC_RIS_DMADONECTX_MASK                ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_RIS_DMADONECTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONECTX_SET                 ((uint32_t)0x00000200U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONEDRX] Bits */
#define USBLC_RIS_DMADONEDRX_OFS                 (10)                            /* !< DMADONEDRX Offset */
#define USBLC_RIS_DMADONEDRX_MASK                ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_RIS_DMADONEDRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONEDRX_SET                 ((uint32_t)0x00000400U)         /* !< Interrupt occured */
/* USBLC_RIS[DMADONEDTX] Bits */
#define USBLC_RIS_DMADONEDTX_OFS                 (11)                            /* !< DMADONEDTX Offset */
#define USBLC_RIS_DMADONEDTX_MASK                ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_RIS_DMADONEDTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMADONEDTX_SET                 ((uint32_t)0x00000800U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPREARX] Bits */
#define USBLC_RIS_DMAPREARX_OFS                  (12)                            /* !< DMAPREARX Offset */
#define USBLC_RIS_DMAPREARX_MASK                 ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_RIS_DMAPREARX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPREARX_SET                  ((uint32_t)0x00001000U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPREATX] Bits */
#define USBLC_RIS_DMAPREATX_OFS                  (13)                            /* !< DMAPREATX Offset */
#define USBLC_RIS_DMAPREATX_MASK                 ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_RIS_DMAPREATX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPREATX_SET                  ((uint32_t)0x00002000U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPREBRX] Bits */
#define USBLC_RIS_DMAPREBRX_OFS                  (14)                            /* !< DMAPREBRX Offset */
#define USBLC_RIS_DMAPREBRX_MASK                 ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_RIS_DMAPREBRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPREBRX_SET                  ((uint32_t)0x00004000U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPREBTX] Bits */
#define USBLC_RIS_DMAPREBTX_OFS                  (15)                            /* !< DMAPREBTX Offset */
#define USBLC_RIS_DMAPREBTX_MASK                 ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_RIS_DMAPREBTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPREBTX_SET                  ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPRECRX] Bits */
#define USBLC_RIS_DMAPRECRX_OFS                  (16)                            /* !< DMAPRECRX Offset */
#define USBLC_RIS_DMAPRECRX_MASK                 ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_RIS_DMAPRECRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPRECRX_SET                  ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPRECTX] Bits */
#define USBLC_RIS_DMAPRECTX_OFS                  (17)                            /* !< DMAPRECTX Offset */
#define USBLC_RIS_DMAPRECTX_MASK                 ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_RIS_DMAPRECTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPRECTX_SET                  ((uint32_t)0x00020000U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPREDRX] Bits */
#define USBLC_RIS_DMAPREDRX_OFS                  (18)                            /* !< DMAPREDRX Offset */
#define USBLC_RIS_DMAPREDRX_MASK                 ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_RIS_DMAPREDRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPREDRX_SET                  ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* USBLC_RIS[DMAPREDTX] Bits */
#define USBLC_RIS_DMAPREDTX_OFS                  (19)                            /* !< DMAPREDTX Offset */
#define USBLC_RIS_DMAPREDTX_MASK                 ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_RIS_DMAPREDTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_RIS_DMAPREDTX_SET                  ((uint32_t)0x00080000U)         /* !< Interrupt occured */

/* USBLC_MIS Bits */
/* USBLC_MIS[INTRTX] Bits */
#define USBLC_MIS_INTRTX_OFS                     (0)                             /* !< INTRTX Offset */
#define USBLC_MIS_INTRTX_MASK                    ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USBLC_MIS_INTRTX_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_INTRTX_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* USBLC_MIS[INTRRX] Bits */
#define USBLC_MIS_INTRRX_OFS                     (1)                             /* !< INTRRX Offset */
#define USBLC_MIS_INTRRX_MASK                    ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USBLC_MIS_INTRRX_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_INTRRX_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* USBLC_MIS[INTRUSB] Bits */
#define USBLC_MIS_INTRUSB_OFS                    (2)                             /* !< INTRUSB Offset */
#define USBLC_MIS_INTRUSB_MASK                   ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USBLC_MIS_INTRUSB_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_INTRUSB_SET                    ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* USBLC_MIS[VUSBPWRDN] Bits */
#define USBLC_MIS_VUSBPWRDN_OFS                  (3)                             /* !< VUSBPWRDN Offset */
#define USBLC_MIS_VUSBPWRDN_MASK                 ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USBLC_MIS_VUSBPWRDN_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_VUSBPWRDN_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONEARX] Bits */
#define USBLC_MIS_DMADONEARX_OFS                 (4)                             /* !< DMADONEARX Offset */
#define USBLC_MIS_DMADONEARX_MASK                ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_MIS_DMADONEARX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONEARX_SET                 ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONEATX] Bits */
#define USBLC_MIS_DMADONEATX_OFS                 (5)                             /* !< DMADONEATX Offset */
#define USBLC_MIS_DMADONEATX_MASK                ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_MIS_DMADONEATX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONEATX_SET                 ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONEBRX] Bits */
#define USBLC_MIS_DMADONEBRX_OFS                 (6)                             /* !< DMADONEBRX Offset */
#define USBLC_MIS_DMADONEBRX_MASK                ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_MIS_DMADONEBRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONEBRX_SET                 ((uint32_t)0x00000040U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONEBTX] Bits */
#define USBLC_MIS_DMADONEBTX_OFS                 (7)                             /* !< DMADONEBTX Offset */
#define USBLC_MIS_DMADONEBTX_MASK                ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_MIS_DMADONEBTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONEBTX_SET                 ((uint32_t)0x00000080U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONECRX] Bits */
#define USBLC_MIS_DMADONECRX_OFS                 (8)                             /* !< DMADONECRX Offset */
#define USBLC_MIS_DMADONECRX_MASK                ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_MIS_DMADONECRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONECRX_SET                 ((uint32_t)0x00000100U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONECTX] Bits */
#define USBLC_MIS_DMADONECTX_OFS                 (9)                             /* !< DMADONECTX Offset */
#define USBLC_MIS_DMADONECTX_MASK                ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_MIS_DMADONECTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONECTX_SET                 ((uint32_t)0x00000200U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONEDRX] Bits */
#define USBLC_MIS_DMADONEDRX_OFS                 (10)                            /* !< DMADONEDRX Offset */
#define USBLC_MIS_DMADONEDRX_MASK                ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_MIS_DMADONEDRX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONEDRX_SET                 ((uint32_t)0x00000400U)         /* !< Interrupt occured */
/* USBLC_MIS[DMADONEDTX] Bits */
#define USBLC_MIS_DMADONEDTX_OFS                 (11)                            /* !< DMADONEDTX Offset */
#define USBLC_MIS_DMADONEDTX_MASK                ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_MIS_DMADONEDTX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMADONEDTX_SET                 ((uint32_t)0x00000800U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPREARX] Bits */
#define USBLC_MIS_DMAPREARX_OFS                  (12)                            /* !< DMAPREARX Offset */
#define USBLC_MIS_DMAPREARX_MASK                 ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_MIS_DMAPREARX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPREARX_SET                  ((uint32_t)0x00001000U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPREATX] Bits */
#define USBLC_MIS_DMAPREATX_OFS                  (13)                            /* !< DMAPREATX Offset */
#define USBLC_MIS_DMAPREATX_MASK                 ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_MIS_DMAPREATX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPREATX_SET                  ((uint32_t)0x00002000U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPREBRX] Bits */
#define USBLC_MIS_DMAPREBRX_OFS                  (14)                            /* !< DMAPREBRX Offset */
#define USBLC_MIS_DMAPREBRX_MASK                 ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_MIS_DMAPREBRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPREBRX_SET                  ((uint32_t)0x00004000U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPREBTX] Bits */
#define USBLC_MIS_DMAPREBTX_OFS                  (15)                            /* !< DMAPREBTX Offset */
#define USBLC_MIS_DMAPREBTX_MASK                 ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_MIS_DMAPREBTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPREBTX_SET                  ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPRECRX] Bits */
#define USBLC_MIS_DMAPRECRX_OFS                  (16)                            /* !< DMAPRECRX Offset */
#define USBLC_MIS_DMAPRECRX_MASK                 ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_MIS_DMAPRECRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPRECRX_SET                  ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPRECTX] Bits */
#define USBLC_MIS_DMAPRECTX_OFS                  (17)                            /* !< DMAPRECTX Offset */
#define USBLC_MIS_DMAPRECTX_MASK                 ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_MIS_DMAPRECTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPRECTX_SET                  ((uint32_t)0x00020000U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPREDRX] Bits */
#define USBLC_MIS_DMAPREDRX_OFS                  (18)                            /* !< DMAPREDRX Offset */
#define USBLC_MIS_DMAPREDRX_MASK                 ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_MIS_DMAPREDRX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPREDRX_SET                  ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* USBLC_MIS[DMAPREDTX] Bits */
#define USBLC_MIS_DMAPREDTX_OFS                  (19)                            /* !< DMAPREDTX Offset */
#define USBLC_MIS_DMAPREDTX_MASK                 ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_MIS_DMAPREDTX_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USBLC_MIS_DMAPREDTX_SET                  ((uint32_t)0x00080000U)         /* !< Interrupt occured */

