subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usblc.h
/* USBLC_ISET Bits */
/* USBLC_ISET[INTRTX] Bits */
#define USBLC_ISET_INTRTX_OFS                    (0)                             /* !< INTRTX Offset */
#define USBLC_ISET_INTRTX_MASK                   ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USBLC_ISET_INTRTX_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_INTRTX_SET                    ((uint32_t)0x00000001U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[INTRRX] Bits */
#define USBLC_ISET_INTRRX_OFS                    (1)                             /* !< INTRRX Offset */
#define USBLC_ISET_INTRRX_MASK                   ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USBLC_ISET_INTRRX_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_INTRRX_SET                    ((uint32_t)0x00000002U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[INTRUSB] Bits */
#define USBLC_ISET_INTRUSB_OFS                   (2)                             /* !< INTRUSB Offset */
#define USBLC_ISET_INTRUSB_MASK                  ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USBLC_ISET_INTRUSB_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_INTRUSB_SET                   ((uint32_t)0x00000004U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[VUSBPWRDN] Bits */
#define USBLC_ISET_VUSBPWRDN_OFS                 (3)                             /* !< VUSBPWRDN Offset */
#define USBLC_ISET_VUSBPWRDN_MASK                ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USBLC_ISET_VUSBPWRDN_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_VUSBPWRDN_SET                 ((uint32_t)0x00000008U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONEARX] Bits */
#define USBLC_ISET_DMADONEARX_OFS                (4)                             /* !< DMADONEARX Offset */
#define USBLC_ISET_DMADONEARX_MASK               ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_ISET_DMADONEARX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONEARX_SET                ((uint32_t)0x00000010U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONEATX] Bits */
#define USBLC_ISET_DMADONEATX_OFS                (5)                             /* !< DMADONEATX Offset */
#define USBLC_ISET_DMADONEATX_MASK               ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_ISET_DMADONEATX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONEATX_SET                ((uint32_t)0x00000020U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONEBRX] Bits */
#define USBLC_ISET_DMADONEBRX_OFS                (6)                             /* !< DMADONEBRX Offset */
#define USBLC_ISET_DMADONEBRX_MASK               ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_ISET_DMADONEBRX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONEBRX_SET                ((uint32_t)0x00000040U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONEBTX] Bits */
#define USBLC_ISET_DMADONEBTX_OFS                (7)                             /* !< DMADONEBTX Offset */
#define USBLC_ISET_DMADONEBTX_MASK               ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_ISET_DMADONEBTX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONEBTX_SET                ((uint32_t)0x00000080U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONECRX] Bits */
#define USBLC_ISET_DMADONECRX_OFS                (8)                             /* !< DMADONECRX Offset */
#define USBLC_ISET_DMADONECRX_MASK               ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_ISET_DMADONECRX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONECRX_SET                ((uint32_t)0x00000100U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONECTX] Bits */
#define USBLC_ISET_DMADONECTX_OFS                (9)                             /* !< DMADONECTX Offset */
#define USBLC_ISET_DMADONECTX_MASK               ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_ISET_DMADONECTX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONECTX_SET                ((uint32_t)0x00000200U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONEDRX] Bits */
#define USBLC_ISET_DMADONEDRX_OFS                (10)                            /* !< DMADONEDRX Offset */
#define USBLC_ISET_DMADONEDRX_MASK               ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_ISET_DMADONEDRX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONEDRX_SET                ((uint32_t)0x00000400U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMADONEDTX] Bits */
#define USBLC_ISET_DMADONEDTX_OFS                (11)                            /* !< DMADONEDTX Offset */
#define USBLC_ISET_DMADONEDTX_MASK               ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_ISET_DMADONEDTX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMADONEDTX_SET                ((uint32_t)0x00000800U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPREARX] Bits */
#define USBLC_ISET_DMAPREARX_OFS                 (12)                            /* !< DMAPREARX Offset */
#define USBLC_ISET_DMAPREARX_MASK                ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_ISET_DMAPREARX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPREARX_SET                 ((uint32_t)0x00001000U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPREATX] Bits */
#define USBLC_ISET_DMAPREATX_OFS                 (13)                            /* !< DMAPREATX Offset */
#define USBLC_ISET_DMAPREATX_MASK                ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_ISET_DMAPREATX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPREATX_SET                 ((uint32_t)0x00002000U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPREBRX] Bits */
#define USBLC_ISET_DMAPREBRX_OFS                 (14)                            /* !< DMAPREBRX Offset */
#define USBLC_ISET_DMAPREBRX_MASK                ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_ISET_DMAPREBRX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPREBRX_SET                 ((uint32_t)0x00004000U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPREBTX] Bits */
#define USBLC_ISET_DMAPREBTX_OFS                 (15)                            /* !< DMAPREBTX Offset */
#define USBLC_ISET_DMAPREBTX_MASK                ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_ISET_DMAPREBTX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPREBTX_SET                 ((uint32_t)0x00008000U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPRECRX] Bits */
#define USBLC_ISET_DMAPRECRX_OFS                 (16)                            /* !< DMAPRECRX Offset */
#define USBLC_ISET_DMAPRECRX_MASK                ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_ISET_DMAPRECRX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPRECRX_SET                 ((uint32_t)0x00010000U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPRECTX] Bits */
#define USBLC_ISET_DMAPRECTX_OFS                 (17)                            /* !< DMAPRECTX Offset */
#define USBLC_ISET_DMAPRECTX_MASK                ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_ISET_DMAPRECTX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPRECTX_SET                 ((uint32_t)0x00020000U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPREDRX] Bits */
#define USBLC_ISET_DMAPREDRX_OFS                 (18)                            /* !< DMAPREDRX Offset */
#define USBLC_ISET_DMAPREDRX_MASK                ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_ISET_DMAPREDRX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPREDRX_SET                 ((uint32_t)0x00040000U)         /* !< Write 1 to set the interrupt */
/* USBLC_ISET[DMAPREDTX] Bits */
#define USBLC_ISET_DMAPREDTX_OFS                 (19)                            /* !< DMAPREDTX Offset */
#define USBLC_ISET_DMAPREDTX_MASK                ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_ISET_DMAPREDTX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ISET_DMAPREDTX_SET                 ((uint32_t)0x00080000U)         /* !< Write 1 to set the interrupt */

/* USBLC_ICLR Bits */
/* USBLC_ICLR[INTRTX] Bits */
#define USBLC_ICLR_INTRTX_OFS                    (0)                             /* !< INTRTX Offset */
#define USBLC_ICLR_INTRTX_MASK                   ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USBLC_ICLR_INTRTX_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_INTRTX_CLR                    ((uint32_t)0x00000001U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[INTRRX] Bits */
#define USBLC_ICLR_INTRRX_OFS                    (1)                             /* !< INTRRX Offset */
#define USBLC_ICLR_INTRRX_MASK                   ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USBLC_ICLR_INTRRX_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_INTRRX_CLR                    ((uint32_t)0x00000002U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[INTRUSB] Bits */
#define USBLC_ICLR_INTRUSB_OFS                   (2)                             /* !< INTRUSB Offset */
#define USBLC_ICLR_INTRUSB_MASK                  ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USBLC_ICLR_INTRUSB_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_INTRUSB_CLR                   ((uint32_t)0x00000004U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[VUSBPWRDN] Bits */
#define USBLC_ICLR_VUSBPWRDN_OFS                 (3)                             /* !< VUSBPWRDN Offset */
#define USBLC_ICLR_VUSBPWRDN_MASK                ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USBLC_ICLR_VUSBPWRDN_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_VUSBPWRDN_CLR                 ((uint32_t)0x00000008U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONEARX] Bits */
#define USBLC_ICLR_DMADONEARX_OFS                (4)                             /* !< DMADONEARX Offset */
#define USBLC_ICLR_DMADONEARX_MASK               ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_ICLR_DMADONEARX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONEARX_CLR                ((uint32_t)0x00000010U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONEATX] Bits */
#define USBLC_ICLR_DMADONEATX_OFS                (5)                             /* !< DMADONEATX Offset */
#define USBLC_ICLR_DMADONEATX_MASK               ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_ICLR_DMADONEATX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONEATX_CLR                ((uint32_t)0x00000020U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONEBRX] Bits */
#define USBLC_ICLR_DMADONEBRX_OFS                (6)                             /* !< DMADONEBRX Offset */
#define USBLC_ICLR_DMADONEBRX_MASK               ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_ICLR_DMADONEBRX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONEBRX_CLR                ((uint32_t)0x00000040U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONEBTX] Bits */
#define USBLC_ICLR_DMADONEBTX_OFS                (7)                             /* !< DMADONEBTX Offset */
#define USBLC_ICLR_DMADONEBTX_MASK               ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_ICLR_DMADONEBTX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONEBTX_CLR                ((uint32_t)0x00000080U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONECRX] Bits */
#define USBLC_ICLR_DMADONECRX_OFS                (8)                             /* !< DMADONECRX Offset */
#define USBLC_ICLR_DMADONECRX_MASK               ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_ICLR_DMADONECRX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONECRX_CLR                ((uint32_t)0x00000100U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONECTX] Bits */
#define USBLC_ICLR_DMADONECTX_OFS                (9)                             /* !< DMADONECTX Offset */
#define USBLC_ICLR_DMADONECTX_MASK               ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_ICLR_DMADONECTX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONECTX_CLR                ((uint32_t)0x00000200U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONEDRX] Bits */
#define USBLC_ICLR_DMADONEDRX_OFS                (10)                            /* !< DMADONEDRX Offset */
#define USBLC_ICLR_DMADONEDRX_MASK               ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_ICLR_DMADONEDRX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONEDRX_CLR                ((uint32_t)0x00000400U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMADONEDTX] Bits */
#define USBLC_ICLR_DMADONEDTX_OFS                (11)                            /* !< DMADONEDTX Offset */
#define USBLC_ICLR_DMADONEDTX_MASK               ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_ICLR_DMADONEDTX_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMADONEDTX_CLR                ((uint32_t)0x00000800U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPREARX] Bits */
#define USBLC_ICLR_DMAPREARX_OFS                 (12)                            /* !< DMAPREARX Offset */
#define USBLC_ICLR_DMAPREARX_MASK                ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USBLC_ICLR_DMAPREARX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPREARX_CLR                 ((uint32_t)0x00001000U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPREATX] Bits */
#define USBLC_ICLR_DMAPREATX_OFS                 (13)                            /* !< DMAPREATX Offset */
#define USBLC_ICLR_DMAPREATX_MASK                ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USBLC_ICLR_DMAPREATX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPREATX_CLR                 ((uint32_t)0x00002000U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPREBRX] Bits */
#define USBLC_ICLR_DMAPREBRX_OFS                 (14)                            /* !< DMAPREBRX Offset */
#define USBLC_ICLR_DMAPREBRX_MASK                ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USBLC_ICLR_DMAPREBRX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPREBRX_CLR                 ((uint32_t)0x00004000U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPREBTX] Bits */
#define USBLC_ICLR_DMAPREBTX_OFS                 (15)                            /* !< DMAPREBTX Offset */
#define USBLC_ICLR_DMAPREBTX_MASK                ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USBLC_ICLR_DMAPREBTX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPREBTX_CLR                 ((uint32_t)0x00008000U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPRECRX] Bits */
#define USBLC_ICLR_DMAPRECRX_OFS                 (16)                            /* !< DMAPRECRX Offset */
#define USBLC_ICLR_DMAPRECRX_MASK                ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USBLC_ICLR_DMAPRECRX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPRECRX_CLR                 ((uint32_t)0x00010000U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPRECTX] Bits */
#define USBLC_ICLR_DMAPRECTX_OFS                 (17)                            /* !< DMAPRECTX Offset */
#define USBLC_ICLR_DMAPRECTX_MASK                ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USBLC_ICLR_DMAPRECTX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPRECTX_CLR                 ((uint32_t)0x00020000U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPREDRX] Bits */
#define USBLC_ICLR_DMAPREDRX_OFS                 (18)                            /* !< DMAPREDRX Offset */
#define USBLC_ICLR_DMAPREDRX_MASK                ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USBLC_ICLR_DMAPREDRX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPREDRX_CLR                 ((uint32_t)0x00040000U)         /* !< Write 1 to clear the interrupt */
/* USBLC_ICLR[DMAPREDTX] Bits */
#define USBLC_ICLR_DMAPREDTX_OFS                 (19)                            /* !< DMAPREDTX Offset */
#define USBLC_ICLR_DMAPREDTX_MASK                ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USBLC_ICLR_DMAPREDTX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USBLC_ICLR_DMAPREDTX_CLR                 ((uint32_t)0x00080000U)         /* !< Write 1 to clear the interrupt */

/* USBLC_PWREN Bits */
/* USBLC_PWREN[ENABLE] Bits */
#define USBLC_PWREN_ENABLE_OFS                   (0)                             /* !< ENABLE Offset */
#define USBLC_PWREN_ENABLE_MASK                  ((uint32_t)0x00000001U)         /* !< Enable the power */
#define USBLC_PWREN_ENABLE_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable Power */
#define USBLC_PWREN_ENABLE_ENABLE                ((uint32_t)0x00000001U)         /* !< Enable Power */
/* USBLC_PWREN[KEY] Bits */
#define USBLC_PWREN_KEY_OFS                      (24)                            /* !< KEY Offset */
#define USBLC_PWREN_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define USBLC_PWREN_KEY_UNLOCK_W                 ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

